android-file-transfer
appcleaner
beardedspice
clion
contexts
dash
docker
epubquicklook
evernote
gimp
google-chrome
intellij-idea
iterm2
java
keepingyouawake
mactex
ngrok
numi
postman
pycharm
qlcolorcode
qlmarkdown
qlprettypatch
qlstephen
quicklook-csv
quicklook-json
skim
skype
slack
sublime-text
suspicious-package
telegram
texpad
transmission
valentina-studio
virtualbox
vlc
vox
webpquicklook
gitkraken
