tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "watsonbox/cmu-sphinx"
cask "java"
brew "ack"
brew "antigen"
brew "automake"
brew "bfg"
brew "cmu-sphinxbase"
brew "cmu-pocketsphinx"
brew "drafter"
brew "ghostscript", link: false
brew "git-lfs"
brew "htop"
brew "python"
brew "httpie"
brew "imagemagick"
brew "insect"
brew "nmap"
brew "pyenv"
brew "python@2"
brew "qt"
brew "rethinkdb"
brew "siege"
brew "swig"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "android-file-transfer"
cask "appcleaner"
cask "beardedspice"
cask "clion"
cask "contexts"
cask "dash"
cask "discord"
cask "docker"
cask "epubquicklook"
cask "evernote"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gimp"
cask "gitkraken"
cask "google-chrome"
cask "ibettercharge"
cask "intellij-idea"
cask "iterm2"
cask "keepingyouawake"
cask "ngrok"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "skim"
cask "skype"
cask "slack"
cask "suspicious-package"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "valentina-studio"
cask "virtualbox"
cask "visual-studio-code"
cask "vk-messenger"
cask "vlc"
cask "vox"
cask "webpquicklook"
