tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "watsonbox/cmu-sphinx"
cask "java"
brew "ack"
brew "antigen"
brew "automake"
brew "bat"
brew "bfg"
brew "ccat"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "ctags"
brew "docker-machine-completion"
brew "drafter"
brew "ffmpeg"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "git-open"
brew "go"
brew "htop"
brew "python"
brew "httpie"
brew "imagemagick"
brew "insect"
brew "pandoc"
brew "jupyter"
brew "less"
brew "lesspipe"
brew "micro"
brew "mono", link: false
brew "neovim"
brew "nmap"
brew "pulseaudio", restart_service: true
brew "pyenv"
brew "python@2"
brew "qt"
brew "rethinkdb"
brew "siege"
brew "source-highlight"
brew "spark"
brew "swig"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "android-file-transfer"
cask "appcleaner"
cask "beardedspice"
cask "clion"
cask "contexts"
cask "dash"
cask "datagrip"
cask "discord"
cask "docker"
cask "epubquicklook"
cask "evernote"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gimp"
cask "gitkraken"
cask "go2shell"
cask "google-chrome"
cask "ibettercharge"
cask "intellij-idea"
cask "ipynb-quicklook"
cask "iterm2"
cask "keepingyouawake"
cask "ngrok"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "skim"
cask "skype"
cask "slack"
cask "sublime-text"
cask "suspicious-package"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vk-messenger"
cask "vlc"
cask "vox"
cask "webpquicklook"
cask "yujitach-menumeters"
