mitinarseny/dotfiles path:iTerm2/.iterm2_shell_integration.zsh
mafredri/zsh-async
sindresorhus/pure path:pure.zsh
wfxr/forgit
zsh-users/zsh-history-substring-search
Homebrew/brew path:completions/zsh kind:fpath
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
hlissner/zsh-autopair path:autopair.zsh
zdharma/fast-syntax-highlighting
denysdovhan/gitio-zsh
marzocchi/zsh-notify
kwhrtsk/docker-fzf-completion
docker/cli path:contrib/completion/zsh/ kind:fpath
docker/compose path:contrib/completion/zsh/ kind:fpath