##########################
#####    Formulas    #####
##########################

# GNU file, shell and text utilities
brew "coreutils"

# install apps from macOS App Store with brew
brew "mas"

# rm to trash
brew "trash"

# list working tree recursively
brew "tree"

###########################
#####      Casks      #####
###########################


# transfer files from/to android devices
cask "android-file-transfer"

# remove apps and all 
cask "appcleaner"

# control web media players with media keys
cask "beardedspice"

# stats for battery
cask "coconutbattery"

# enchanced Alt+Tab menu 
cask "contexts"

# quicklook .epub files
cask "epubquicklook"

# open terminal from folder in Finder.app
cask "go2shell"

# monitor you devices batteries
cask "ibettercharge"

# quicklook for .ipynb
cask "ipynb-quicklook"

# quicklook for .ipynb
cask "jupyter-notebook-ql"

# do not sleep toogle
cask "keepingyouawake"

# quicklook for source code with syntax highlighting
cask "qlcolorcode"

# display image info within quicklook
cask "qlimagesize"

# quicklook for markdown
cask "qlmarkdown"

# QuickLook generator for patch files
cask "qlprettypatch"

# quicklook for videos
cask "qlvideo"

# CSV quicklook
cask "quicklook-csv"

# JSON quicklook
cask "quicklook-json"

# PDF viewer
cask "skim"

# inspect macOS installer packages
cask "suspicious-package"

cask "the-unarchiver"

# torrent utility
cask "transmission"

# VPN utility
cask "tunnelblick"

# quicklook for .webp
cask "webpquicklook"

# vidoe editor
mas "iMovie", id: 408981434

# Apple PowerPoint
mas "Keynote", id: 409183694

# Apple Excel
mas "Numbers", id: 409203825

# Apple Word
mas "Pages", id: 409201541

# IDE for macOS and iOS development
mas "Xcode", id: 497799835
