##########################
#####      Taps      #####
##########################

tap "caffix/amass"
tap "getantibody/tap"
tap "go-swagger/go-swagger"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mitinarseny/tap"
tap "mongodb/brew"
tap "tomanthony/brews"
tap "twpayne/taps"

##########################
#####    Formulas    #####
##########################

brew "automake"

# cat clone with syntax highlighting and Git integration
brew "bat"

# cryptography SSL/TLS toolkit
brew "openssl"

# remove large files or passwords from Git repository
brew "bfg"

# binary grep
brew "bgrep"

# library for command-line editing
brew "readline"

# python language
brew "python"

# clang formatter
brew "clang-format"

# count lines of code
brew "cloc"

# cross-platform make
brew "cmake"

# GNU file, shell and text utilities
brew "coreutils"

# generate tag files for source code
brew "ctags"

# GNU data recovery tool
brew "ddrescue"

# Go programming language
brew "go"

# select default apps for docuements and URL schemes on macOS
brew "duti"

# simple, fast and user-friendly alternative to 'find'
brew "fd"

# fc-cache
brew "fontconfig"

# asynchronous event library
brew "libevent"

# play, record, comvert and stream audio and video
brew "ffmpeg"

# GNU debugger
brew "gdb"

# interpreter for PostScript and PDF
brew "ghostscript"

# verision control system
brew "git"

# git extension for versioning large files
brew "git-lfs"

# graph visualisation
brew "graphviz"

# Dockerfile linter
brew "hadolint"

# interactive process viewer
brew "htop"

# command-line replacement
brew "httpie"

# network logon cracker
brew "hydra"

# tools and libraries to manipulate images in many formats
brew "imagemagick"

# build network application on V8
brew "node"

# high precision scientific calculator with support for physycal units
brew "insect"

# command-line JSON processor
brew "jq"

# universal markup converter
brew "pandoc"

# interactive environments for writing and running code
brew "jupyter"

# pager
brew "less"

# configuration file processing library
brew "libconfig"

# portable library for network traffic capture
brew "libpcap"

# library to render SVG files using Cairo
brew "librsvg"

# lighweight programming language
brew "lua"

# install apps from macOS App Store with brew
brew "mas"

# intercept, modyfy, replay, save HTTP/S traffic
brew "mitmproxy"

# open source relational database management system
brew "mysql"

# x86 assembler
brew "nasm"

# Vim fork focused on extensibility and agility
brew "neovim"

# port scanning utility
brew "nmap"

# manage multiple node.js versions
brew "nvm"

# SSL/TLS implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: true

# print info and check PNG, JNG and MNG files
brew "pngcheck"

# framework for managing multi-langugage pre-commit hooks
brew "pre-commit"

# sound system for POSIZ OSes
brew "pulseaudio", restart_service: true

# monitor data is processes through a pipe
brew "pv"

# python version management
brew "pyenv"

# cross-platform application and UI framework
brew "qt"

# reverse engineering framework
brew "radare2"

# safe, concurrent practical language
brew "rust"

# HTTP regression testing and benchmarking utility 
brew "siege"

# penetration testing for SQL injection and database servers
brew "sqlmap"

# generate scripting interfaces to C/C++ code
brew "swig"

# a faster alternative to ack
brew "the_silver_searcher"

# terminal multiplexer
brew "tmux"

# rm to trash
brew "trash"

# list working tree recursively
brew "tree"

# record a GIF from terminal
brew "ttygif"

# powerful command-line editor
brew "vim"

# download videos from youtube
brew "youtube-dl"

# general-purpose lossless data-complession library
brew "zlib"

# POSIX-compilant shell designed for interactive use
brew "zsh"

# in-depth attack surface mapping and asset discovery
brew "caffix/amass/amass"

# generate golang server from swagger spec
brew "go-swagger/go-swagger/go-swagger"

# release golang packages
brew "goreleaser/tap/goreleaser"

# cli for heroku
brew "heroku/brew/heroku"

# document-oriented database
brew "mongodb/brew/mongodb-community"

###########################
#####      Casks      #####
###########################

# cross-platform, GPU-accelerated terminal emulator
cask "alacritty"

# transfer files from/to android devices
cask "android-file-transfer"

# remove apps and all 
cask "appcleaner"

# control web media players with media keys
cask "beardedspice"

# JetBrains IDE for C/C++
cask "clion"

# stats for battery
cask "coconutbattery"

# enchanced Alt+Tab menu 
cask "contexts"

# Qt GUI for radare2
cask "cutter"

# offline documentation
cask "dash"

# JetBrains tool for database management systems
cask "datagrip"

# online audio/video/text chat
cask "discord"

# container management system
cask "docker"

# quicklook .epub files
cask "epubquicklook"

# reverse engineering tool 
cask "ghidra"

# photo editor
cask "gimp"

# open terminal from folder in Finder.app
cask "go2shell"

# web browser
cask "google-chrome"

# monitor you devices batteries
cask "ibettercharge"

# multi-language JetBrains IDE
cask "intellij-idea"

# quicklook for .ipynb
cask "ipynb-quicklook"

cask "java"

# quicklook for .ipynb
cask "jupyter-notebook-ql"

# do not sleep toogle
cask "keepingyouawake"

# instant, secure URL to your localhost server through any NAT or firewall
cask "ngrok"

# API development tool
cask "postman"

# quicklook for source code with syntax highlighting
cask "qlcolorcode"

# display image info within quicklook
cask "qlimagesize"

# quicklook for markdown
cask "qlmarkdown"

# QuickLook generator for patch files
cask "qlprettypatch"

# quicklook for videos
cask "qlvideo"

# CSV quicklook
cask "quicklook-csv"

# JSON quicklook
cask "quicklook-json"

# PDF viewer
cask "skim"

# online audio/video/text chats
cask "skype"

# messaging for work
cask "slack"

# inspect macOS installer packages
cask "suspicious-package"

# the best messaging tool that humanity has ever created
cask "telegram"

cask "the-unarchiver"

# torrent utility
cask "transmission"

# VPN utility
cask "tunnelblick"

# media player
cask "vlc"

# quicklook for .webp
cask "webpquicklook"

# network protocol analyser
cask "wireshark"

# PDF converting tool
cask "wkhtmltopdf"

# vidoe editor
mas "iMovie", id: 408981434

# Apple PowerPoint
mas "Keynote", id: 409183694

# Apple Excel
mas "Numbers", id: 409203825

# Apple Word
mas "Pages", id: 409201541

# IDE for macOS and iOS development
mas "Xcode", id: 497799835
